{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_1", "batch_input_shape": [null, 720, 1280, 1], "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "name": "Conv1", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 60, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "name": "Conv2", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 50, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "name": "Conv3", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 40, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "name": "Conv4", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 30, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "name": "Conv5", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 20, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "name": "Conv6", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 10, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "name": "Conv7", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 5, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.2, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [4, 4], "data_format": "channels_last", "name": "Conv8", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 1, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.2, "trainable": true}}], "keras_version": "2.0.4", "backend": "tensorflow"}